zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
          </instance>
        </module>
        <module name="GCLK" id="03588" name2="clk_gclk_u2122_v1" version="v1">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="I" pad="PA07"/>
              <signal group="IO" index="0" function="I" pad="PA23"/>
              <signal group="IO" index="0" function="I" pad="PA31"/>
              <signal group="IO" index="0" function="I" pad="PA03"/>
              <signal group="IO" index="1" function="I" pad="PA04"/>
              <signal group="IO" index="1" function="I" pad="PA08"/>
              <signal group="IO" index="1" function="I" pad="PA11"/>
              <signal group="IO" index="1" function="I" pad="PA22"/>
              <signal group="IO" index="1" function="I" pad="PA24"/>
              <signal group="IO" index="1" function="I" pad="PA29"/>
              <signal group="IO" index="1" function="I" pad="PA00"/>
              <signal group="IO" index="2" function="I" pad="PA05"/>
              <signal group="IO" index="2" function="I" pad="PA09"/>
              <signal group="IO" index="2" function="I" pad="PA20"/>
              <signal group="IO" index="2" function="I" pad="PA25"/>
              <signal group="IO" index="2" function="I" pad="PA01"/>
              <signal group="IO" index="3" function="I" pad="PA02"/>
              <signal group="IO" index="3" function="I" pad="PA06"/>
              <signal group="IO" index="3" function="I" pad="PA10"/>
              <signal group="IO" index="3" function="I" pad="PA21"/>
              <signal group="IO" index="3" function="I" pad="PA26"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="2"/>
              <param name="GEN_NUM" value="4" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="3" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="5" caption="Number of Generic Clock Sources - 1"/>
              <param name="NUM" value="13" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="3"/>
              <param name="SOURCE_GCLKGEN1" value="2"/>
              <param name="SOURCE_GCLKIN" value="1"/>
              <param name="SOURCE_NUM" value="6" caption="Number of Generic Clock Sources"/>
              <param name="SOURCE_OSCHF" value="0"/>
              <param name="SOURCE_OSC32K" value="3"/>
              <param name="SOURCE_OSC600K_DIV4" value="5"/>
              <param name="SOURCE_XOSC" value="0"/>
              <param name="SOURCE_XOSC32K" value="4"/>
              <param name="INSTANCE_ID" value="7" caption="Instance index for GCLK"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" name2="I7638" version="2.b.3">
          <instance name="HMATRIXHS">
            <register-group name="HMATRIXHS" name-in-module="HMATRIXB" address-space="base" offset="0x4100A000"/>
            <parameters>
              <param name="INSTANCE_ID" value="37" caption="Instance index for HMATRIXHS"/>
            </parameters>
          </instance>
        </module>
        <module name="MCLK" id="U2234" name2="U2234" version="v1">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x40000800"/>
            <parameters>
              <param name="CTRLA_MCSEL_GCLK" value="1"/>
              <param name="CTRLA_MCSEL_OSC8M" value="0"/>
              <param name="MCLK_CLK_APB_NUM" value="3"/>
              <param name="SYSTEM_CLOCK" value="4000000" caption="System Clock Frequency at Reset"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for MCLK"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="APBA" bit="0"/>
                <clock name="APBB" bit="1"/>
                <clock name="APBC" bit="2"/>
                <clock name="DSU" bit="3"/>
                <clock name="HMATRIXHS" bit="4"/>
                <clock name="NVMCTRL" bit="5"/>
                <clock name="HSRAM" bit="6"/>
                <clock name="DMAC" bit="7"/>
                <clock name="PAC" bit="8"/>
                <clock name="BROM" bit="9"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="MTB" id="U2002" name2="U2002" version="1.a.0">
          <instance name="MTB">
            <register-group name="MTB" name-in-module="MTB" address-space="base" offset="0x41008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="36" caption="Instance index for MTB"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="15" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="2" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="NVMCTRL" id="06228" name2="nvm_ctrl_arm_v1" version="v1">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <parameters>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0xC0000007FFFFFFFF"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="9"/>
              <param name="REGION_LOCK_NUM" value="16" caption="Number of regions that can be individually protected or unprotected"/>
              <param name="ROW_PAGES" value="4"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0xC01FFFFFFFFFFFFF"/>
              <param name="FLASH_SIZE" value="65536"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES" value="128"/>
              <param name="PAGES_PR_REGION" value="8"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for NVMCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="06251" name2="osc_32kctrl_arm_v1" version="v1">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA24"/>
              <signal group="XOUT32" function="XOUT32" pad="PA25"/>
            </signals>
            <parameters>
              <param name="HAS_XOSC32K" value="1" caption="OSC32K module includes external 32KHz"/>
              <param name="OSC32K_CALIB_MSB" value="5" caption="Bits for internal OSC32kHz Calibration"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for OSC32KCTRL"/>
            </parameters>
          </instance>
        </module>
