zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
          </instance>
        </module>
        <module name="SystemControl" id="SYSTEM_IP" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="03609" name2="tmr_tc_u2249_v3" version="v1">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_MC_0" value="6" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="7" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="5" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="9" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="67" caption="Instance index for TC0"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA02"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="1" function="E" pad="PA03"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_MC_0" value="9" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="10" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="8" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="9" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="68" caption="Instance index for TC1"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="1" function="E" pad="PA21"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_MC_0" value="12" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="13" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="11" caption="Indexes of DMA Overflow trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="10" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="69" caption="Instance index for TC2"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="03610" name2="tmr_tcc_u2213_v4" version="v1">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA00"/>
              <signal group="WO" index="0" function="F" pad="PA08"/>
              <signal group="WO" index="0" function="F" pad="PA16"/>
              <signal group="WO" index="0" function="F" pad="PA24"/>
              <signal group="WO" index="0" function="F" pad="PB00"/>
              <signal group="WO" index="0" function="F" pad="PB08"/>
              <signal group="WO" index="1" function="F" pad="PA01"/>
              <signal group="WO" index="1" function="F" pad="PA09"/>
              <signal group="WO" index="1" function="F" pad="PA17"/>
              <signal group="WO" index="1" function="F" pad="PA25"/>
              <signal group="WO" index="1" function="F" pad="PB01"/>
              <signal group="WO" index="1" function="F" pad="PB09"/>
              <signal group="WO" index="2" function="F" pad="PA02"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="2" function="F" pad="PA26"/>
              <signal group="WO" index="2" function="F" pad="PB02"/>
              <signal group="WO" index="2" function="F" pad="PB10"/>
              <signal group="WO" index="3" function="F" pad="PA03"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="3" function="F" pad="PA27"/>
              <signal group="WO" index="3" function="F" pad="PB03"/>
              <signal group="WO" index="3" function="F" pad="PB11"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="15" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="16" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="17" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="18" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_OVF" value="14" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="11" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="4" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="70" caption="Instance index for TCC0"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" name2="U2251" version="v1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8" caption="Instance index for WDT"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PAC SUPC"/>
        <interrupt name="WDT" index="1" module-instance="WDT"/>
        <interrupt name="RTC" index="2" module-instance="RTC"/>
        <interrupt name="EIC" index="3" module-instance="EIC"/>
        <interrupt name="NVMCTRL" index="4" module-instance="NVMCTRL"/>
        <interrupt name="DMAC" index="5" module-instance="DMAC"/>
        <interrupt name="EVSYS" index="6" module-instance="EVSYS"/>
        <interrupt name="SERCOM0" index="7" module-instance="SERCOM0"/>
        <interrupt name="SERCOM1" index="8" module-instance="SERCOM1"/>
        <interrupt name="TC0" index="9" module-instance="TC0"/>
        <interrupt name="TC1" index="10" module-instance="TC1"/>
        <interrupt name="TC2" index="11" module-instance="TC2"/>
        <interrupt name="TCC0" index="12" module-instance="TCC0"/>
        <interrupt name="ADC0" index="13" module-instance="ADC0"/>
        <interrupt name="AC" index="14" module-instance="AC"/>
      </interrupts>
      <events>
        <generators>
          <generator name="OSC32KCTRL_CLKFAIL" index="1" module-instance="OSC32KCTRL"/>
          <generator name="SUPC_MVIO" index="2" module-instance="SUPC"/>
          <generator name="SUPC_VLM" index="3" module-instance="SUPC"/>
          <generator name="RTC_CMP_0" index="4" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="5" module-instance="RTC"/>
          <generator name="RTC_OVF" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_0" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="11" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="12" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="13" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="14" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="15" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="29" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="30" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="31" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="32" module-instance="DMAC"/>
          <generator name="TC0_OVF" index="33" module-instance="TC0"/>
          <generator name="TC0_MC_0" index="34" module-instance="TC0"/>
          <generator name="TC0_MC_1" index="35" module-instance="TC0"/>
          <generator name="TC1_OVF" index="36" module-instance="TC1"/>
          <generator name="TC1_MC_0" index="37" module-instance="TC1"/>
          <generator name="TC1_MC_1" index="38" module-instance="TC1"/>
          <generator name="TC2_OVF" index="39" module-instance="TC2"/>
          <generator name="TC2_MC_0" index="40" module-instance="TC2"/>
          <generator name="TC2_MC_1" index="41" module-instance="TC2"/>
          <generator name="TCC0_OVF" index="42" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="43" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="44" module-instance="TCC0"/>
          <generator name="TCC0_MC_0" index="45" module-instance="TCC0"/>
          <generator name="TCC0_MC_1" index="46" module-instance="TCC0"/>
          <generator name="TCC0_MC_2" index="47" module-instance="TCC0"/>
          <generator name="TCC0_MC_3" index="48" module-instance="TCC0"/>
          <generator name="ADC0_RESRDY" index="49" module-instance="ADC0"/>
          <generator name="ADC0_SAMPRDY" index="50" module-instance="ADC0"/>
          <generator name="ADC0_WCMP" index="51" module-instance="ADC0"/>
          <generator name="AC_COMP_0" index="52" module-instance="AC"/>
          <generator name="AC_COMP_1" index="53" module-instance="AC"/>
          <generator name="AC_WIN_0" index="54" module-instance="AC"/>
          <generator name="CCL_LUTOUT_0" index="55" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="56" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_2" index="57" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_3" index="58" module-instance="CCL"/>
          <generator name="SYSCTRL_OSCTEST" index="59" module-instance="SYSCTRL"/>
          <generator name="PAC_ACCERR" index="60" module-instance="PAC"/>
          <generator name="DSU_SWCCSTAT" index="61" module-instance="DSU"/>
          <generator name="DSU_COMP" index="62" module-instance="DSU"/>
        </generators>
        <users>
          <user name="PORT_EV_0" index="0" module-instance="PORT"/>
          <user name="PORT_EV_1" index="1" module-instance="PORT"/>
          <user name="PORT_EV_2" index="2" module-instance="PORT"/>
          <user name="PORT_EV_3" index="3" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="4" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="5" module-instance="DMAC"/>
          <user name="TC0_EVU" index="6" module-instance="TC0"/>
          <user name="TC1_EVU" index="7" module-instance="TC1"/>
          <user name="TC2_EVU" index="8" module-instance="TC2"/>
          <user name="TCC0_EV_0" index="9" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="10" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="11" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="12" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="13" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="14" module-instance="TCC0"/>
          <user name="ADC0_START" index="15" module-instance="ADC0"/>
          <user name="CCL_LUTIN_0" index="16" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="17" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="18" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="19" module-instance="CCL"/>
          <user name="MTB_START" index="20" module-instance="MTB"/>
          <user name="MTB_STOP" index="21" module-instance="MTB"/>
          <user name="SYSCTRL_OSCTEST" index="22" module-instance="SYSCTRL"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x0BA02053"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="06254" name2="cmp_ctrl_arm_v1" version="v1" caption="Analog Comparator">
      <register-group name="COMP" size="0x10">
        <register name="COMPCTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Comparator # Comparator Control A">
          <bitfield name="ENABLE" caption="Comparator Enable" mask="0x2"/>
          <bitfield name="OUT" caption="Output Enable" mask="0x4"/>
          <bitfield name="HYSTEN" caption="Hysteresis Enable" mask="0x8"/>
          <bitfield name="INTSEL" caption="Interrupt Selection" mask="0x30" values="AC_COMPCTRLA__INTSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="MUXNEG" caption="Negative Input Selection" mask="0x700" values="AC_COMPCTRLA__MUXNEG"/>
          <bitfield name="MUXPOS" caption="Positive Input Selection" mask="0x7000" values="AC_COMPCTRLA__MUXPOS"/>
        </register>
        <register name="COMPCTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Comparator # Comparator Control B">
          <bitfield name="REFSEL" caption="Reference Selection" mask="0x3" values="AC_COMPCTRLB__REFSEL"/>
        </register>
        <register name="COMPSCALER" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Comparator # Comparator Scaler">
          <bitfield name="VALUE" caption="Scaled Reference Voltage" mask="0xFF"/>
        </register>
      </register-group>
