zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
      <register-group name="AC" caption="Analog Comparator">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Global Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="INTREF" caption="Internal Reference Selection" mask="0x3" values="AC_CTRLB__INTREF"/>
        </register>
        <register name="WINCTRL" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Window Control">
          <bitfield name="WEN0" caption="Window 0 Enable" mask="0x1"/>
          <bitfield name="WINTSEL0" caption="Window 0 Interrupt Selection" mask="0x6" values="AC_WINCTRL__WINTSELx"/>
        </register>
        <register name="EVCTRL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
        </register>
        <register name="INTENCLR" offset="0x24" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTENSET" offset="0x28" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTFLAG" offset="0x2C" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Flag" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Flag" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Flag" mask="0x10"/>
        </register>
        <register name="INTFLAGSET" offset="0x30" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Flag" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Flag" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Flag" mask="0x10"/>
        </register>
        <register name="STATUS" offset="0x34" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="COMPSTATE0" caption="Comparator 0 State" mask="0x1"/>
          <bitfield name="COMPSTATE1" caption="Comparator 1 State" mask="0x2"/>
          <bitfield name="WINSTATE0" caption="Window 0 State" mask="0x30" values="AC_STATUS__WINSTATEx"/>
        </register>
        <register-group name="COMP" name-in-module="COMP" offset="0x40" size="0x10" count="2"/>
        <register name="WPCTRL" offset="0x80" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="AC_WPCTRL__WPKEY"/>
        </register>
      </register-group>
      <value-group name="AC_COMPCTRLA__INTSEL">
        <value name="TOGGLE" caption="Interrupt on comparator n output toggle" value="0x0"/>
        <value name="RISING" caption="Interrupt on comparator n output rising edge" value="0x1"/>
        <value name="FALLING" caption="Interrupt on comparator n output falling edge" value="0x2"/>
      </value-group>
      <value-group name="AC_COMPCTRLA__MUXNEG">
        <value name="AINN0" caption="Negative pin 0" value="0"/>
        <value name="AINN1" caption="Negative pin 1" value="1"/>
        <value name="AINN2" caption="Negative pin 2" value="2"/>
        <value name="VREFSCALE" caption="Voltage Reference Scaler" value="7"/>
      </value-group>
      <value-group name="AC_COMPCTRLA__MUXPOS">
        <value name="AINP0" caption="Positive pin 0" value="0"/>
        <value name="AINP1" caption="Positive pin 1" value="1"/>
        <value name="AINP2" caption="Positive pin 2" value="2"/>
        <value name="AINP3" caption="Positive pin 3" value="3"/>
        <value name="AINP5" caption="Positive pin 5" value="5"/>
        <value name="AINP6" caption="Positive pin 6" value="6"/>
        <value name="VDDIO2DIV10" caption="VDDIO2 Div10" value="7"/>
      </value-group>
      <value-group name="AC_COMPCTRLB__REFSEL">
        <value name="VDD" caption="VDD" value="0x0"/>
        <value name="INTVREF" caption="Internal reference voltage, as defined by the Internal Reference Selection bit field in the Control B register (CTRLB.INTREF)" value="0x1"/>
        <value name="EXTVREF" caption="External reference pin" value="0x2"/>
      </value-group>
      <value-group name="AC_CTRLB__INTREF">
        <value name="1V024" caption="Internal 1.024V reference" value="0x0"/>
        <value name="2V048" caption="Internal 2.048V reference" value="0x1"/>
        <value name="4V096" caption="Internal 4.096V reference" value="0x2"/>
        <value name="2V500" caption="Internal 2.500V reference" value="0x3"/>
      </value-group>
      <value-group name="AC_WINCTRL__WINTSELx">
        <value name="ABOVE" caption="Interrupt when the signal goes above the window" value="0x0"/>
        <value name="INSIDE" caption="Interrupt when the signal goes inside the window" value="0x1"/>
        <value name="BELOW" caption="Interrupt when the signal goes below the window" value="0x2"/>
        <value name="OUTSIDE" caption="Interrupt when the signal goes outside the window" value="0x3"/>
      </value-group>
      <value-group name="AC_STATUS__WINSTATEx">
        <value name="ABOVE" caption="The input signal is above window n" value="0x0"/>
        <value name="INSIDE" caption="The input signal is inside window n" value="0x1"/>
        <value name="BELOW" caption="The input signal is below window n" value="0x2"/>
      </value-group>
      <value-group name="AC_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x414320"/>
      </value-group>
    </module>
    <module name="ADC" id="06272" name2="adc_12b_diff_ctrl_arm_v1" version="v1" caption="Analog-to-Digital Converter">
      <register-group name="ADC" caption="Analog-to-Digital Converter">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="ADC Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand" mask="0x80"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x1F" values="ADC_CTRLB__PRESCALER"/>
          <bitfield name="TIMEBASE" caption="Timebase" mask="0x1F00"/>
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Control C">
          <bitfield name="REFSEL" caption="Reference Selection" mask="0x7" values="ADC_CTRLC__REFSEL"/>
        </register>
