zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
        <register name="SEQCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Sequential Control">
          <bitfield name="SEQSEL0" caption="Sequential Selection 0" mask="0xF" values="CCL_SEQCTRL__SEQSELx"/>
          <bitfield name="SEQSEL1" caption="Sequential Selection 1" mask="0xF00" values="CCL_SEQCTRL__SEQSELx"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="4" initval="0x00000000" caption="LUT Control #">
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80"/>
          <bitfield name="INSEL0" caption="LUT Input 0 Source Selection" mask="0xF00" values="CCL_LUTCTRL__INSELx"/>
          <bitfield name="INSEL1" caption="LUT Input 1 Source Selection" mask="0xF000" values="CCL_LUTCTRL__INSELx"/>
          <bitfield name="INSEL2" caption="LUT Input 2 Source Selection" mask="0xF0000" values="CCL_LUTCTRL__INSELx"/>
          <bitfield name="LUTINV" caption="LUT Inverted Event Input Enable" mask="0x100000"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000"/>
          <bitfield name="TRUTH" caption="Truth Table" mask="0xFF000000"/>
        </register>
        <register name="WPCTRL" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="CCL_WPCTRL__WPKEY"/>
        </register>
      </register-group>
      <value-group name="CCL_SEQCTRL__SEQSELx">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0x0"/>
        <value name="DFF" caption="D flip-flop" value="0x1"/>
        <value name="JK" caption="JK flip-flop" value="0x2"/>
        <value name="LATCH" caption="D latch" value="0x3"/>
        <value name="RS" caption="RS latch" value="0x4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0x0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="0x1"/>
        <value name="FILTER" caption="Filter enabled" value="0x2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSELx">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="AC" caption="AC input source: CMP[0] (LUT0) / CMP[1] (LUT1) / CMP[0] (LUT2) / CMP[1] (LUT3)" value="0x5"/>
        <value name="TC" caption="TC input source: TC0 (LUT0) / TC1 (LUT1) / TC2 (LUT2) / TC0 (LUT3)" value="0x6"/>
        <value name="TCC" caption="TCC input source: TCC0" value="0x8"/>
        <value name="SERCOM" caption="SERCOM input source: SERCOM0 (LUT0) / SERCOM1 (LUT1) / SERCOM0 (LUT2) / SERCOM1 (LUT3)" value="0x9"/>
        <value name="ASYNCEVENT" caption="Asynchronous event input source" value="0xB"/>
      </value-group>
      <value-group name="CCL_WPCTRL__WPKEY">
        <value name="KEY" caption="Allow writes to the WPCTRL register" value="0x43434C"/>
      </value-group>
    </module>
    <module name="DMAC" id="04495" name2="dma_dmac_u2223_v2" version="v1" caption="Direct Memory Access Controller">
      <register-group name="DMAC" caption="Direct Memory Access Controller" aligned="8">
        <register name="CTRL" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="DMAENABLE" caption="DMA Enable" mask="0x2"/>
          <bitfield name="CRCENABLE" caption="CRC Enable" mask="0x4"/>
          <bitfield name="LVLEN0" caption="Priority Level 0 Enable" mask="0x100"/>
          <bitfield name="LVLEN1" caption="Priority Level 1 Enable" mask="0x200"/>
          <bitfield name="LVLEN2" caption="Priority Level 2 Enable" mask="0x400"/>
          <bitfield name="LVLEN3" caption="Priority Level 3 Enable" mask="0x800"/>
        </register>
        <register name="CRCCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="CRC Control">
          <bitfield name="CRCBEATSIZE" caption="CRC Beat Size" mask="0x3" values="DMAC_CRCCTRL__CRCBEATSIZE"/>
          <bitfield name="CRCPOLY" caption="CRC Polynomial Type" mask="0xC" values="DMAC_CRCCTRL__CRCPOLY"/>
          <bitfield name="CRCSRC" caption="CRC Input Source" mask="0x3F00" values="DMAC_CRCCTRL__CRCSRC"/>
        </register>
        <register name="CRCDATAIN" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CRC Data Input">
          <bitfield name="CRCDATAIN" caption="CRC Data Input" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCCHKSUM" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CRC Checksum">
          <bitfield name="CRCCHKSUM" caption="CRC Checksum" mask="0xFFFFFFFF"/>
        </register>
        <register name="CRCSTATUS" offset="0xC" rw="RW" size="1" initval="0x00" caption="CRC Status">
          <bitfield name="CRCBUSY" caption="CRC Module Busy" mask="0x1"/>
          <bitfield name="CRCZERO" caption="CRC Zero" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0xD" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="QOSCTRL" offset="0xE" rw="RW" size="1" initval="0x2A" caption="Quality of Service Control">
          <bitfield name="WRBQOS" caption="Write-Back Quality of Service" mask="0x3" values="DMAC_QOSCTRL__WRBQOS"/>
          <bitfield name="FQOS" caption="Fetch Quality of Service" mask="0xC" values="DMAC_QOSCTRL__FQOS"/>
          <bitfield name="DQOS" caption="Data Transfer Quality of Service" mask="0x30" values="DMAC_QOSCTRL__DQOS"/>
        </register>
        <register name="SWTRIGCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Software Trigger Control">
          <bitfield name="SWTRIG0" caption="Channel 0 Software Trigger" mask="0x1"/>
          <bitfield name="SWTRIG1" caption="Channel 1 Software Trigger" mask="0x2"/>
        </register>
