zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
      <value-group name="DMAC_BTCTRL__EVOSEL">
        <value name="DISABLE" caption="Event generation disabled" value="0x0"/>
        <value name="BLOCK" caption="Event strobe when block transfer complete" value="0x1"/>
        <value name="BEAT" caption="Event strobe when beat transfer complete" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BLOCKACT">
        <value name="NOACT" caption="Channel will be disabled if it is the last block transfer in the transaction" value="0x0"/>
        <value name="INT" caption="Channel will be disabled if it is the last block transfer in the transaction and block interrupt" value="0x1"/>
        <value name="SUSPEND" caption="Channel suspend operation is completed" value="0x2"/>
        <value name="BOTH" caption="Both channel suspend operation and block interrupt" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BEATSIZE">
        <value name="BYTE" caption="8-bit" value="0x0"/>
        <value name="HWORD" caption="16-bit" value="0x1"/>
        <value name="WORD" caption="32-bit" value="0x2"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSEL">
        <value name="DST" caption="Step size settings apply to the destination address" value="0x0"/>
        <value name="SRC" caption="Step size settings apply to the source address" value="0x1"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSIZE">
        <value name="X1" caption="Next ADDR = ADDR + (Beat size in byte) * 1" value="0x0"/>
        <value name="X2" caption="Next ADDR = ADDR + (Beat size in byte) * 2" value="0x1"/>
        <value name="X4" caption="Next ADDR = ADDR + (Beat size in byte) * 4" value="0x2"/>
        <value name="X8" caption="Next ADDR = ADDR + (Beat size in byte) * 8" value="0x3"/>
        <value name="X16" caption="Next ADDR = ADDR + (Beat size in byte) * 16" value="0x4"/>
        <value name="X32" caption="Next ADDR = ADDR + (Beat size in byte) * 32" value="0x5"/>
        <value name="X64" caption="Next ADDR = ADDR + (Beat size in byte) * 64" value="0x6"/>
        <value name="X128" caption="Next ADDR = ADDR + (Beat size in byte) * 128" value="0x7"/>
      </value-group>
    </module>
    <module name="DSU" id="06333" name2="icd_dsu_arm_v1" version="v1" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000004" caption="Control B">
          <bitfield name="DCCDMALVL0" caption="DMA Trigger 0 Level" mask="0x1" values="DSU_CTRLB__DCCDMALVLx"/>
          <bitfield name="DCCDMALVL1" caption="DMA Trigger 1 Level" mask="0x2" values="DSU_CTRLB__DCCDMALVLx"/>
          <bitfield name="QOS" caption="DSU QoS Level" mask="0xC" values="DSU_CTRLB__QOS"/>
        </register>
        <register name="WPCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="DSU_WPCTRL__WPKEY"/>
        </register>
        <register name="CTRLC" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="Control C">
          <bitfield name="DBGRW0" caption="CPU0 Debug R/W" mask="0x1"/>
        </register>
        <register name="STATUSA" offset="0x104" rw="R" size="4" initval="0x00000000" caption="Status A">
          <bitfield name="DONE" caption="Done Status" mask="0x1"/>
          <bitfield name="CRSTEXT0" caption="CPU0 Reset Extension Status" mask="0x100"/>
          <bitfield name="BREXT0" caption="Boot ROM 0 Phase Extension Status" mask="0x10000"/>
        </register>
        <register name="STATUSB" offset="0x108" rw="R" size="4" initval="0x00000000" caption="Status B">
          <bitfield name="BCCD0" caption="Boot ROM Communication Channel 0 Dirty" mask="0x1"/>
          <bitfield name="BCCD1" caption="Boot ROM Communication Channel 1 Dirty" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="DBGPRES" caption="Debugger Present Status" mask="0x100"/>
          <bitfield name="HPS" caption="Hot-plugging Status" mask="0x400"/>
        </register>
        <register name="BCC" offset="0x110" rw="RW" size="4" count="2" caption="Boot ROM Channel #">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x118" rw="RW" size="4" count="2" caption="Debug Communication Channel #">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x120" rw="R" size="4" initval="0x0BA02053" caption="Device Identification">
          <bitfield name="FV" caption="Fixed Value of 1" mask="0x1"/>
          <bitfield name="MANID" caption="JEDEC Manufacture ID" mask="0xFFE"/>
          <bitfield name="PNDID" caption="Part Number Device ID" mask="0xFF000"/>
          <bitfield name="PNMID" caption="Part Number Mask ID" mask="0xFF00000"/>
          <bitfield name="VER" caption="Version Code" mask="0xF0000000"/>
        </register>
        <register name="DAL" offset="0x124" rw="R" size="4" caption="Debugger Access Level">
          <bitfield name="CPU0" caption="CPU 0 Debugger Access Level" mask="0x3" values="DSU_DAL__CPU0"/>
        </register>
        <register name="ENTRY0" offset="0x1000" rw="R" size="4" caption="CoreSight ROM Table Entry 0">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY1" offset="0x1004" rw="R" size="4" caption="CoreSight ROM Table Entry 1">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY2" offset="0x1008" rw="R" size="4" caption="CoreSight ROM Table Entry 2">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="ENTRY3" offset="0x100C" rw="R" size="4" caption="CoreSight ROM Table Entry 3">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Memory Type">
          <bitfield name="SYSMEM" caption="CoreSight System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 4">
          <bitfield name="DES2" caption="CoreSight JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="SIZE" caption="CoreSight Size" mask="0xF0"/>
        </register>
