zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
        <register name="USER" offset="0x80" rw="RW" size="4" count="23" initval="0x00000000" caption="User # Channel Selection">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0x1F" values="EVSYS_USER__CHANNEL"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0x0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="0x1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="0x2"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0x0"/>
        <value name="RISING_EDGE" caption="Event detection occurs only on the rising edge of the signal from the event generator" value="0x1"/>
        <value name="FALLING_EDGE" caption="Event detection occurs only on the falling edge of the signal from the event generator" value="0x2"/>
        <value name="BOTH_EDGES" caption="Event detection occurs on both the rising and falling edges of the signal from the event generator" value="0x3"/>
      </value-group>
      <value-group name="EVSYS_USER__CHANNEL">
        <value name="OFF" caption="The Event System user is not connected to any channel" value="0x00"/>
        <value name="CHANNEL0" caption="The Event System user is connected to Channel 0" value="0x01"/>
        <value name="CHANNEL1" caption="The Event System user is connected to Channel 1" value="0x02"/>
        <value name="CHANNEL2" caption="The Event System user is connected to Channel 2" value="0x03"/>
        <value name="CHANNEL3" caption="The Event System user is connected to Channel 3" value="0x04"/>
      </value-group>
    </module>
    <module name="FUSES" id="06285" name2="pic32cm_pl10_fuses" version="v1" caption="Non-Volatile Fuses">
      <register-group name="FUSES_BOOTCFG" caption="Non-Volatile Fuses">
        <register name="SEQNUM" offset="0x0" rw="RW" size="4" initval="0xFFFFFFFF" caption="Sequence Number Fuse">
          <bitfield name="SEQNUM" caption="Sequence Number" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOOTPROT" offset="0x8" rw="RW" size="4" initval="0xFFFFFFFF" caption="Boot Protection Fuse">
          <bitfield name="BOOTPROT" caption="Boot Protection" mask="0x7" values="FUSES_BOOTPROT__BOOTPROT"/>
        </register>
        <register name="WDTCFG" offset="0x10" rw="RW" size="4" initval="0xFFFFFFFF" caption="Watchdog Timer Configuration Fuse">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WEN" caption="Window Mode Enable" mask="0x4"/>
          <bitfield name="ALWAYSON" caption="Always On" mask="0x8"/>
          <bitfield name="PER" caption="Time-Out Period" mask="0xF00" values="FUSES_WDTCFG__PER"/>
          <bitfield name="WINDOW" caption="Window" mask="0xF000" values="FUSES_WDTCFG__WINDOW"/>
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset Fuse" mask="0xF0000" values="FUSES_WDTCFG__EWOFFSET"/>
        </register>
        <register name="BODCFG" offset="0x18" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOD Configuration Fuse">
          <bitfield name="ENABLE" caption="BOD Enable" mask="0x2"/>
          <bitfield name="STDBYCFG" caption="BOD Configuration in Standby Sleep Mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="BOD Operation Mode in Active Mode" mask="0x100" values="FUSES_BODCFG__ACTCFG"/>
          <bitfield name="SAMPFREQ" caption="BOD Sampling Frequency" mask="0x1000" values="FUSES_BODCFG__SAMPFREQ"/>
          <bitfield name="LEVEL" caption="BOD Level" mask="0x30000" values="FUSES_BODCFG__LEVEL"/>
          <bitfield name="VLMLVL" caption="Voltage Level Monitor Level" mask="0x3000000" values="FUSES_BODCFG__VLMLVL"/>
          <bitfield name="VLMCFG" caption="Voltage Level Monitor Interrupt Configuration" mask="0xC000000" values="FUSES_BODCFG__VLMCFG"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80000000"/>
        </register>
        <register name="USERCFG" offset="0x20" rw="RW" size="4" initval="0xFFFFFFFF" caption="User Configuration Fuse">
          <bitfield name="MVIOMODE" caption="MVIO Operation Mode" mask="0x1" values="FUSES_USERCFG__MVIOMODE"/>
          <bitfield name="CRCSEL" caption="CRC Polynomial Selection" mask="0x40" values="FUSES_USERCFG__CRCSEL"/>
          <bitfield name="CRCBOOT" caption="CRC Boot" mask="0x80"/>
          <bitfield name="SUT" caption="Start-up Time" mask="0x700" values="FUSES_USERCFG__SUT"/>
        </register>
        <register name="BOOT_GPIOSEL" offset="0x28" rw="RW" size="4" initval="0xFFFFFFFF" caption="Boot External Notification I/O Pin Fuse">
          <bitfield name="GPIOPINSEL" caption="GPIO Pin Select for Boot External Notification Signal" mask="0x1F" values="FUSES_BOOT_GPIOSEL__GPIOPINSEL"/>
          <bitfield name="ENABLE" caption="Enable Boot External Notification Signal" mask="0x80"/>
          <bitfield name="GPIOPORTSEL" caption="GPIO Port Select for Boot External Notification Signal" mask="0xF00" values="FUSES_BOOT_GPIOSEL__GPIOPORTSEL"/>
          <bitfield name="POL" caption="Select Polarity in Normal Drive Mode for Boot External Notification Signal" mask="0x20000" values="FUSES_BOOT_GPIOSEL__POL"/>
          <bitfield name="ODRAIN" caption="Open Drain Control for Boot External Notification Signal" mask="0x80000" values="FUSES_BOOT_GPIOSEL__ODRAIN"/>
          <bitfield name="SLEWLIM" caption="Slew Rate Control for Boot External Notification Signal" mask="0x100000" values="FUSES_BOOT_GPIOSEL__SLEWLIM"/>
        </register>
      </register-group>
      <register-group name="FUSES_SIGNATURE" caption="Non-Volatile Fuses">
        <register name="SERNUM0" offset="0x20" rw="R" size="4" initval="0xFFFFFFFF" caption="Serial Number 0">
          <bitfield name="SERNUM0" caption="Serial Number 0" mask="0xFFFFFFFF"/>
        </register>
