zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
        <register name="SERNUM1" offset="0x28" rw="R" size="4" initval="0xFFFFFFFF" caption="Serial Number 1">
          <bitfield name="SERNUM1" caption="Serial Number 1" mask="0xFFFFFFFF"/>
        </register>
        <register name="SERNUM2" offset="0x30" rw="R" size="4" initval="0xFFFFFFFF" caption="Serial Number 2">
          <bitfield name="SERNUM2" caption="Serial Number 2" mask="0xFFFFFFFF"/>
        </register>
        <register name="SERNUM3" offset="0x38" rw="R" size="4" initval="0xFFFFFFFF" caption="Serial Number 3">
          <bitfield name="SERNUM3" caption="Serial Number 3" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="FUSES_BOOTPROT__BOOTPROT">
        <value name="SIZE_32768BYTES" caption="32768 bytes are protected." value="0x0"/>
        <value name="SIZE_16384BYTES" caption="16384 bytes are protected." value="0x1"/>
        <value name="SIZE_8192BYTES" caption="8192 bytes are protected." value="0x2"/>
        <value name="SIZE_4096BYTES" caption="4096 bytes are protected." value="0x3"/>
        <value name="SIZE_2048BYTES" caption="2048 bytes are protected." value="0x4"/>
        <value name="SIZE_1024BYTES" caption="1024 bytes are protected." value="0x5"/>
        <value name="SIZE_512BYTES" caption="512 bytes are protected." value="0x6"/>
        <value name="SIZE_0BYTES" caption="0 bytes are protected." value="0x7"/>
      </value-group>
      <value-group name="FUSES_WDTCFG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="FUSES_WDTCFG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="FUSES_WDTCFG__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="FUSES_BODCFG__ACTCFG">
        <value name="CONT" caption="Continuous Mode" value="0x0"/>
        <value name="SAMP" caption="Sampling Mode" value="0x1"/>
      </value-group>
      <value-group name="FUSES_BODCFG__SAMPFREQ">
        <value name="128HZ" caption="128 Hz Sampling Frequency" value="0x0"/>
        <value name="32HZ" caption="32 Hz Sampling Frequency" value="0x1"/>
      </value-group>
      <value-group name="FUSES_BODCFG__LEVEL">
        <value name="BODLEVEL0" caption="1.90V" value="0x0"/>
        <value name="BODLEVEL1" caption="2.45V" value="0x1"/>
        <value name="BODLEVEL2" caption="2.70V" value="0x2"/>
        <value name="BODLEVEL3" caption="2.85V" value="0x3"/>
      </value-group>
      <value-group name="FUSES_BODCFG__VLMLVL">
        <value name="OFF" caption="VLM disabled" value="0x0"/>
        <value name="5ABOVE" caption="VLM threshold is 5% above BOD threshold" value="0x1"/>
      </value-group>
      <value-group name="FUSES_BODCFG__VLMCFG">
        <value name="FALLING" caption="VDD falls below VLM threshold" value="0x0"/>
        <value name="RISING" caption="VDD rises above VLM threshold" value="0x1"/>
        <value name="BOTH" caption="VDD crosses VLM threshold" value="0x2"/>
      </value-group>
      <value-group name="FUSES_USERCFG__MVIOMODE">
        <value name="DUAL" caption="MVIO operating in dual supply mode" value="0x0"/>
        <value name="SINGLE" caption="MVIO operating in Single supply mode" value="0x1"/>
      </value-group>
      <value-group name="FUSES_USERCFG__CRCSEL">
        <value name="CRC16" caption="CRC-16-CCITT" value="0x0"/>
        <value name="CRC32" caption="CRC-32 (IEEE 802.3)" value="0x1"/>
      </value-group>
      <value-group name="FUSES_USERCFG__SUT">
        <value name="0MS" caption="0 ms" value="0x0"/>
        <value name="1MS" caption="1 ms" value="0x1"/>
        <value name="2MS" caption="2 ms" value="0x2"/>
        <value name="4MS" caption="4 ms" value="0x3"/>
        <value name="8MS" caption="8 ms" value="0x4"/>
        <value name="16MS" caption="16 ms" value="0x5"/>
        <value name="32MS" caption="32 ms" value="0x6"/>
        <value name="64MS" caption="64 ms" value="0x7"/>
      </value-group>
