zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
          <bitfield name="OUT0SET" caption="PORT Data Output Value 0 Set" mask="0x1"/>
          <bitfield name="OUT1SET" caption="PORT Data Output Value 1 Set" mask="0x2"/>
          <bitfield name="OUT2SET" caption="PORT Data Output Value 2 Set" mask="0x4"/>
          <bitfield name="OUT3SET" caption="PORT Data Output Value 3 Set" mask="0x8"/>
          <bitfield name="OUT4SET" caption="PORT Data Output Value 4 Set" mask="0x10"/>
          <bitfield name="OUT5SET" caption="PORT Data Output Value 5 Set" mask="0x20"/>
          <bitfield name="OUT6SET" caption="PORT Data Output Value 6 Set" mask="0x40"/>
          <bitfield name="OUT7SET" caption="PORT Data Output Value 7 Set" mask="0x80"/>
          <bitfield name="OUT8SET" caption="PORT Data Output Value 8 Set" mask="0x100"/>
          <bitfield name="OUT9SET" caption="PORT Data Output Value 9 Set" mask="0x200"/>
          <bitfield name="OUT10SET" caption="PORT Data Output Value 10 Set" mask="0x400"/>
          <bitfield name="OUT11SET" caption="PORT Data Output Value 11 Set" mask="0x800"/>
          <bitfield name="OUT12SET" caption="PORT Data Output Value 12 Set" mask="0x1000"/>
          <bitfield name="OUT13SET" caption="PORT Data Output Value 13 Set" mask="0x2000"/>
          <bitfield name="OUT14SET" caption="PORT Data Output Value 14 Set" mask="0x4000"/>
          <bitfield name="OUT15SET" caption="PORT Data Output Value 15 Set" mask="0x8000"/>
          <bitfield name="OUT16SET" caption="PORT Data Output Value 16 Set" mask="0x10000"/>
          <bitfield name="OUT17SET" caption="PORT Data Output Value 17 Set" mask="0x20000"/>
          <bitfield name="OUT18SET" caption="PORT Data Output Value 18 Set" mask="0x40000"/>
          <bitfield name="OUT19SET" caption="PORT Data Output Value 19 Set" mask="0x80000"/>
          <bitfield name="OUT20SET" caption="PORT Data Output Value 20 Set" mask="0x100000"/>
          <bitfield name="OUT21SET" caption="PORT Data Output Value 21 Set" mask="0x200000"/>
          <bitfield name="OUT22SET" caption="PORT Data Output Value 22 Set" mask="0x400000"/>
          <bitfield name="OUT23SET" caption="PORT Data Output Value 23 Set" mask="0x800000"/>
          <bitfield name="OUT24SET" caption="PORT Data Output Value 24 Set" mask="0x1000000"/>
          <bitfield name="OUT25SET" caption="PORT Data Output Value 25 Set" mask="0x2000000"/>
          <bitfield name="OUT26SET" caption="PORT Data Output Value 26 Set" mask="0x4000000"/>
          <bitfield name="OUT27SET" caption="PORT Data Output Value 27 Set" mask="0x8000000"/>
          <bitfield name="OUT28SET" caption="PORT Data Output Value 28 Set" mask="0x10000000"/>
          <bitfield name="OUT29SET" caption="PORT Data Output Value 29 Set" mask="0x20000000"/>
          <bitfield name="OUT30SET" caption="PORT Data Output Value 30 Set" mask="0x40000000"/>
          <bitfield name="OUT31SET" caption="PORT Data Output Value 31 Set" mask="0x80000000"/>
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
          <bitfield name="OUT0TGL" caption="PORT Data Output Value 0 Toggle" mask="0x1"/>
          <bitfield name="OUT1TGL" caption="PORT Data Output Value 1 Toggle" mask="0x2"/>
          <bitfield name="OUT2TGL" caption="PORT Data Output Value 2 Toggle" mask="0x4"/>
          <bitfield name="OUT3TGL" caption="PORT Data Output Value 3 Toggle" mask="0x8"/>
          <bitfield name="OUT4TGL" caption="PORT Data Output Value 4 Toggle" mask="0x10"/>
          <bitfield name="OUT5TGL" caption="PORT Data Output Value 5 Toggle" mask="0x20"/>
          <bitfield name="OUT6TGL" caption="PORT Data Output Value 6 Toggle" mask="0x40"/>
          <bitfield name="OUT7TGL" caption="PORT Data Output Value 7 Toggle" mask="0x80"/>
          <bitfield name="OUT8TGL" caption="PORT Data Output Value 8 Toggle" mask="0x100"/>
          <bitfield name="OUT9TGL" caption="PORT Data Output Value 9 Toggle" mask="0x200"/>
          <bitfield name="OUT10TGL" caption="PORT Data Output Value 10 Toggle" mask="0x400"/>
          <bitfield name="OUT11TGL" caption="PORT Data Output Value 11 Toggle" mask="0x800"/>
          <bitfield name="OUT12TGL" caption="PORT Data Output Value 12 Toggle" mask="0x1000"/>
          <bitfield name="OUT13TGL" caption="PORT Data Output Value 13 Toggle" mask="0x2000"/>
          <bitfield name="OUT14TGL" caption="PORT Data Output Value 14 Toggle" mask="0x4000"/>
          <bitfield name="OUT15TGL" caption="PORT Data Output Value 15 Toggle" mask="0x8000"/>
          <bitfield name="OUT16TGL" caption="PORT Data Output Value 16 Toggle" mask="0x10000"/>
          <bitfield name="OUT17TGL" caption="PORT Data Output Value 17 Toggle" mask="0x20000"/>
          <bitfield name="OUT18TGL" caption="PORT Data Output Value 18 Toggle" mask="0x40000"/>
          <bitfield name="OUT19TGL" caption="PORT Data Output Value 19 Toggle" mask="0x80000"/>
          <bitfield name="OUT20TGL" caption="PORT Data Output Value 20 Toggle" mask="0x100000"/>
          <bitfield name="OUT21TGL" caption="PORT Data Output Value 21 Toggle" mask="0x200000"/>
          <bitfield name="OUT22TGL" caption="PORT Data Output Value 22 Toggle" mask="0x400000"/>
          <bitfield name="OUT23TGL" caption="PORT Data Output Value 23 Toggle" mask="0x800000"/>
          <bitfield name="OUT24TGL" caption="PORT Data Output Value 24 Toggle" mask="0x1000000"/>
          <bitfield name="OUT25TGL" caption="PORT Data Output Value 25 Toggle" mask="0x2000000"/>
          <bitfield name="OUT26TGL" caption="PORT Data Output Value 26 Toggle" mask="0x4000000"/>
          <bitfield name="OUT27TGL" caption="PORT Data Output Value 27 Toggle" mask="0x8000000"/>
          <bitfield name="OUT28TGL" caption="PORT Data Output Value 28 Toggle" mask="0x10000000"/>
          <bitfield name="OUT29TGL" caption="PORT Data Output Value 29 Toggle" mask="0x20000000"/>
          <bitfield name="OUT30TGL" caption="PORT Data Output Value 30 Toggle" mask="0x40000000"/>
          <bitfield name="OUT31TGL" caption="PORT Data Output Value 31 Toggle" mask="0x80000000"/>
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
          <bitfield name="IN0" caption="PORT Data Input Value 0" mask="0x1"/>
          <bitfield name="IN1" caption="PORT Data Input Value 1" mask="0x2"/>
          <bitfield name="IN2" caption="PORT Data Input Value 2" mask="0x4"/>
          <bitfield name="IN3" caption="PORT Data Input Value 3" mask="0x8"/>
          <bitfield name="IN4" caption="PORT Data Input Value 4" mask="0x10"/>
          <bitfield name="IN5" caption="PORT Data Input Value 5" mask="0x20"/>
          <bitfield name="IN6" caption="PORT Data Input Value 6" mask="0x40"/>
          <bitfield name="IN7" caption="PORT Data Input Value 7" mask="0x80"/>
          <bitfield name="IN8" caption="PORT Data Input Value 8" mask="0x100"/>
          <bitfield name="IN9" caption="PORT Data Input Value 9" mask="0x200"/>
          <bitfield name="IN10" caption="PORT Data Input Value 10" mask="0x400"/>
          <bitfield name="IN11" caption="PORT Data Input Value 11" mask="0x800"/>
          <bitfield name="IN12" caption="PORT Data Input Value 12" mask="0x1000"/>
          <bitfield name="IN13" caption="PORT Data Input Value 13" mask="0x2000"/>
          <bitfield name="IN14" caption="PORT Data Input Value 14" mask="0x4000"/>
          <bitfield name="IN15" caption="PORT Data Input Value 15" mask="0x8000"/>
          <bitfield name="IN16" caption="PORT Data Input Value 16" mask="0x10000"/>
          <bitfield name="IN17" caption="PORT Data Input Value 17" mask="0x20000"/>
          <bitfield name="IN18" caption="PORT Data Input Value 18" mask="0x40000"/>
          <bitfield name="IN19" caption="PORT Data Input Value 19" mask="0x80000"/>
          <bitfield name="IN20" caption="PORT Data Input Value 20" mask="0x100000"/>
          <bitfield name="IN21" caption="PORT Data Input Value 21" mask="0x200000"/>
          <bitfield name="IN22" caption="PORT Data Input Value 22" mask="0x400000"/>
          <bitfield name="IN23" caption="PORT Data Input Value 23" mask="0x800000"/>
          <bitfield name="IN24" caption="PORT Data Input Value 24" mask="0x1000000"/>
          <bitfield name="IN25" caption="PORT Data Input Value 25" mask="0x2000000"/>
          <bitfield name="IN26" caption="PORT Data Input Value 26" mask="0x4000000"/>
          <bitfield name="IN27" caption="PORT Data Input Value 27" mask="0x8000000"/>
          <bitfield name="IN28" caption="PORT Data Input Value 28" mask="0x10000000"/>
          <bitfield name="IN29" caption="PORT Data Input Value 29" mask="0x20000000"/>
          <bitfield name="IN30" caption="PORT Data Input Value 30" mask="0x40000000"/>
          <bitfield name="IN31" caption="PORT Data Input Value 31" mask="0x80000000"/>
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING0" caption="Input Sampling Mode 0" mask="0x1"/>
          <bitfield name="SAMPLING1" caption="Input Sampling Mode 1" mask="0x2"/>
          <bitfield name="SAMPLING2" caption="Input Sampling Mode 2" mask="0x4"/>
          <bitfield name="SAMPLING3" caption="Input Sampling Mode 3" mask="0x8"/>
          <bitfield name="SAMPLING4" caption="Input Sampling Mode 4" mask="0x10"/>
          <bitfield name="SAMPLING5" caption="Input Sampling Mode 5" mask="0x20"/>
          <bitfield name="SAMPLING6" caption="Input Sampling Mode 6" mask="0x40"/>
          <bitfield name="SAMPLING7" caption="Input Sampling Mode 7" mask="0x80"/>
          <bitfield name="SAMPLING8" caption="Input Sampling Mode 8" mask="0x100"/>
          <bitfield name="SAMPLING9" caption="Input Sampling Mode 9" mask="0x200"/>
          <bitfield name="SAMPLING10" caption="Input Sampling Mode 10" mask="0x400"/>
          <bitfield name="SAMPLING11" caption="Input Sampling Mode 11" mask="0x800"/>
          <bitfield name="SAMPLING12" caption="Input Sampling Mode 12" mask="0x1000"/>
          <bitfield name="SAMPLING13" caption="Input Sampling Mode 13" mask="0x2000"/>
          <bitfield name="SAMPLING14" caption="Input Sampling Mode 14" mask="0x4000"/>
          <bitfield name="SAMPLING15" caption="Input Sampling Mode 15" mask="0x8000"/>
          <bitfield name="SAMPLING16" caption="Input Sampling Mode 16" mask="0x10000"/>
          <bitfield name="SAMPLING17" caption="Input Sampling Mode 17" mask="0x20000"/>
          <bitfield name="SAMPLING18" caption="Input Sampling Mode 18" mask="0x40000"/>
          <bitfield name="SAMPLING19" caption="Input Sampling Mode 19" mask="0x80000"/>
          <bitfield name="SAMPLING20" caption="Input Sampling Mode 20" mask="0x100000"/>
          <bitfield name="SAMPLING21" caption="Input Sampling Mode 21" mask="0x200000"/>
          <bitfield name="SAMPLING22" caption="Input Sampling Mode 22" mask="0x400000"/>
          <bitfield name="SAMPLING23" caption="Input Sampling Mode 23" mask="0x800000"/>
          <bitfield name="SAMPLING24" caption="Input Sampling Mode 24" mask="0x1000000"/>
          <bitfield name="SAMPLING25" caption="Input Sampling Mode 25" mask="0x2000000"/>
          <bitfield name="SAMPLING26" caption="Input Sampling Mode 26" mask="0x4000000"/>
          <bitfield name="SAMPLING27" caption="Input Sampling Mode 27" mask="0x8000000"/>
          <bitfield name="SAMPLING28" caption="Input Sampling Mode 28" mask="0x10000000"/>
          <bitfield name="SAMPLING29" caption="Input Sampling Mode 29" mask="0x20000000"/>
          <bitfield name="SAMPLING30" caption="Input Sampling Mode 30" mask="0x40000000"/>
          <bitfield name="SAMPLING31" caption="Input Sampling Mode 31" mask="0x80000000"/>
        </register>
