zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
        <register name="WRCONFIG" offset="0x28" rw="W" size="4" access-size="4" initval="0x00000000" caption="Write Configuration">
          <bitfield name="PINMASK" caption="Pin Mask for Multiple Pin Configuration" mask="0xFFFF"/>
          <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x10000"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
          <bitfield name="SLEWLIM" caption="Output Driver Slew Rate Limit Enable" mask="0x100000"/>
          <bitfield name="PMUX" caption="Peripheral Multiplexing" mask="0xF000000" values="PORT_WRCONFIG__PMUX"/>
          <bitfield name="WRPMUX" caption="Write PMUX" mask="0x10000000"/>
          <bitfield name="WRPINCFG" caption="Write PINCFG" mask="0x40000000"/>
          <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="PID0" caption="Event 0 Pin Identifier" mask="0x1F" values="PORT_EVCTRL__PIDx"/>
          <bitfield name="EVACT0" caption="Event 0 Action" mask="0x60" values="PORT_EVCTRL__EVACTx"/>
          <bitfield name="PORTEI0" caption="PORT Event 0 Input Enable" mask="0x80"/>
          <bitfield name="PID1" caption="Event 1 Pin Identifier" mask="0x1F00" values="PORT_EVCTRL__PIDx"/>
          <bitfield name="EVACT1" caption="Event 1 Action" mask="0x6000" values="PORT_EVCTRL__EVACTx"/>
          <bitfield name="PORTEI1" caption="PORT Event 1 Input Enable" mask="0x8000"/>
          <bitfield name="PID2" caption="Event 2 Pin Identifier" mask="0x1F0000" values="PORT_EVCTRL__PIDx"/>
          <bitfield name="EVACT2" caption="Event 2 Action" mask="0x600000" values="PORT_EVCTRL__EVACTx"/>
          <bitfield name="PORTEI2" caption="PORT Event 2 Input Enable" mask="0x800000"/>
          <bitfield name="PID3" caption="Event 3 Pin Identifier" mask="0x1F000000" values="PORT_EVCTRL__PIDx"/>
          <bitfield name="EVACT3" caption="Event 3 Action" mask="0x60000000" values="PORT_EVCTRL__EVACTx"/>
          <bitfield name="PORTEI3" caption="PORT Event 3 Input Enable" mask="0x80000000"/>
        </register>
        <register name="PMUX" offset="0x30" rw="RW" size="1" count="16" initval="0x00" caption="Peripheral Multiplexing #">
          <bitfield name="PMUXE" caption="Peripheral Multiplexing for Even-Numbered Pin" mask="0xF" values="PORT_PMUX__PMUXE"/>
          <bitfield name="PMUXO" caption="Peripheral Multiplexing for Odd-Numbered Pin" mask="0xF0" values="PORT_PMUX__PMUXO"/>
        </register>
        <register name="PINCFG" offset="0x40" rw="RW" size="1" count="32" initval="0x00" caption="Pin Configuration #">
          <bitfield name="PMUXEN" caption="Peripheral Multiplexer Enable" mask="0x1"/>
          <bitfield name="INEN" caption="Input Buffer Enable" mask="0x2"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x4"/>
          <bitfield name="SLEWLIM" caption="Output Driver Slew Rate Limit Enable" mask="0x10"/>
        </register>
      </register-group>
      <register-group name="PORT" caption="I/O Pin Controller">
        <register-group name="GROUP" name-in-module="GROUP" offset="0x00" size="0x80" count="2"/>
      </register-group>
      <value-group name="PORT_WRCONFIG__PMUX">
        <value name="A" caption="Peripheral function A selected" value="0x00"/>
        <value name="B" caption="Peripheral function B selected" value="0x01"/>
        <value name="C" caption="Peripheral function C selected" value="0x02"/>
        <value name="D" caption="Peripheral function D selected" value="0x03"/>
        <value name="E" caption="Peripheral function E selected" value="0x04"/>
        <value name="F" caption="Peripheral function F selected" value="0x05"/>
        <value name="G" caption="Peripheral function G selected" value="0x06"/>
        <value name="H" caption="Peripheral function H selected" value="0x07"/>
        <value name="I" caption="Peripheral function I selected" value="0x08"/>
        <value name="J" caption="Peripheral function J selected" value="0x09"/>
      </value-group>
      <value-group name="PORT_EVCTRL__PIDx">
        <value name="PIN0" caption="Event actions will be executed on pin 0" value="0x00"/>
        <value name="PIN1" caption="Event actions will be executed on pin 1" value="0x01"/>
        <value name="PIN2" caption="Event actions will be executed on pin 2" value="0x02"/>
        <value name="PIN3" caption="Event actions will be executed on pin 3" value="0x03"/>
        <value name="PIN4" caption="Event actions will be executed on pin 4" value="0x04"/>
        <value name="PIN5" caption="Event actions will be executed on pin 5" value="0x05"/>
        <value name="PIN6" caption="Event actions will be executed on pin 6" value="0x06"/>
        <value name="PIN7" caption="Event actions will be executed on pin 7" value="0x07"/>
        <value name="PIN8" caption="Event actions will be executed on pin 8" value="0x08"/>
        <value name="PIN9" caption="Event actions will be executed on pin 9" value="0x09"/>
        <value name="PIN10" caption="Event actions will be executed on pin 10" value="0x0A"/>
        <value name="PIN11" caption="Event actions will be executed on pin 11" value="0x0B"/>
        <value name="PIN12" caption="Event actions will be executed on pin 12" value="0x0C"/>
        <value name="PIN13" caption="Event actions will be executed on pin 13" value="0x0D"/>
        <value name="PIN14" caption="Event actions will be executed on pin 14" value="0x0E"/>
        <value name="PIN15" caption="Event actions will be executed on pin 15" value="0x0F"/>
        <value name="PIN16" caption="Event actions will be executed on pin 16" value="0x10"/>
        <value name="PIN17" caption="Event actions will be executed on pin 17" value="0x11"/>
        <value name="PIN18" caption="Event actions will be executed on pin 18" value="0x12"/>
        <value name="PIN19" caption="Event actions will be executed on pin 19" value="0x13"/>
        <value name="PIN20" caption="Event actions will be executed on pin 20" value="0x14"/>
        <value name="PIN21" caption="Event actions will be executed on pin 21" value="0x15"/>
        <value name="PIN22" caption="Event actions will be executed on pin 22" value="0x16"/>
        <value name="PIN23" caption="Event actions will be executed on pin 23" value="0x17"/>
        <value name="PIN24" caption="Event actions will be executed on pin 24" value="0x18"/>
        <value name="PIN25" caption="Event actions will be executed on pin 25" value="0x19"/>
        <value name="PIN26" caption="Event actions will be executed on pin 26" value="0x1A"/>
        <value name="PIN27" caption="Event actions will be executed on pin 27" value="0x1B"/>
        <value name="PIN28" caption="Event actions will be executed on pin 28" value="0x1C"/>
        <value name="PIN29" caption="Event actions will be executed on pin 29" value="0x1D"/>
        <value name="PIN30" caption="Event actions will be executed on pin 30" value="0x1E"/>
        <value name="PIN31" caption="Event actions will be executed on pin 31" value="0x1F"/>
      </value-group>
