zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
        <register modes="SPI" name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="SPI Status">
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
        </register>
        <register modes="USART" name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="USART Status">
          <bitfield name="PERR" caption="Parity Error" mask="0x1"/>
          <bitfield name="FERR" caption="Frame Error" mask="0x2"/>
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
          <bitfield name="CTS" caption="Clear to Send" mask="0x8"/>
          <bitfield name="ISF" caption="Inconsistent Sync Field" mask="0x10"/>
          <bitfield name="COLL" caption="Collision Detected" mask="0x20"/>
          <bitfield name="TXE" caption="Transmitter Empty" mask="0x40"/>
        </register>
        <register modes="I2CM" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="I2CM Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="SYSOP" caption="System Operation Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="I2CS" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="I2CS Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
        </register>
        <register modes="SPI" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPI Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="USART" name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="USART Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
        </register>
        <register modes="I2CM" name="ADDR" offset="0x24" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="I2CM Address">
          <mode name="DEFAULT"/>
          <mode name="SEVENBIT" qualifier="SERCOM.ADDR.TENBITEN" value="0" caption="7-Bit Addressing mode"/>
          <mode name="TENBIT" qualifier="SERCOM.ADDR.TENBITEN" value="1" caption="10-Bit Addressing mode"/>
          <bitfield modes="SEVENBIT" name="ADDR" caption="Address" mask="0x7F"/>
          <bitfield modes="TENBIT" name="ADDR" caption="Address" mask="0x3FF"/>
          <bitfield modes="DEFAULT" name="LENEN" caption="Transfer Length Enable" mask="0x2000"/>
          <bitfield modes="DEFAULT" name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000"/>
          <bitfield modes="DEFAULT" name="LEN" caption="Transaction Length" mask="0xFF0000"/>
        </register>
        <register modes="I2CS" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="I2CS Address">
          <mode name="DEFAULT"/>
          <mode name="SEVENBIT" qualifier="SERCOM.ADDR.TENBITEN" value="0" caption="7-Bit Addressing mode"/>
          <mode name="TENBIT" qualifier="SERCOM.ADDR.TENBITEN" value="1" caption="10-Bit Addressing mode"/>
          <bitfield modes="DEFAULT" name="GENCEN" caption="General Call Address Enable" mask="0x1"/>
          <bitfield modes="SEVENBIT" name="ADDR" caption="Address" mask="0xFE"/>
          <bitfield modes="TENBIT" name="ADDR" caption="Address" mask="0x7FE"/>
          <bitfield modes="DEFAULT" name="TENBITEN" caption="Ten Bit Addressing Enable" mask="0x8000"/>
          <bitfield modes="SEVENBIT" name="ADDRMASK" caption="Address Mask" mask="0xFE0000"/>
          <bitfield modes="TENBIT" name="ADDRMASK" caption="Address Mask" mask="0x7FE0000"/>
        </register>
        <register modes="SPI" name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPI Address">
          <bitfield name="ADDR" caption="Address" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register modes="I2CM" name="DATA" offset="0x28" rw="RW" access="WSYNC" size="1" initval="0x00" caption="I2CM Data">
          <bitfield name="DATA" caption="Data" mask="0xFF"/>
        </register>
        <register modes="I2CS" name="DATA" offset="0x28" rw="RW" access="RWSYNC" size="1" initval="0x00" caption="I2CS Data">
          <bitfield name="DATA" caption="Data" mask="0xFF"/>
        </register>
        <register modes="SPI" name="DATA" offset="0x28" rw="RW" size="2" initval="0x0000" caption="SPI Data">
          <bitfield name="DATA" caption="Data" mask="0x1FF"/>
        </register>
        <register modes="USART" name="DATA" offset="0x28" rw="RW" size="2" initval="0x0000" caption="USART Data">
          <bitfield name="DATA" caption="Data" mask="0x1FF"/>
        </register>
        <register modes="I2CM" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="I2CM Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
        </register>
        <register modes="SPI" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPI Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
        </register>
        <register modes="USART" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="USART Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="SERCOM_I2CM_CTRLA__MODE">
        <value name="USART_EXT" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI Client mode" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI Host mode" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C Client mode" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C Host mode" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SDAHOLD">
        <value name="DIS" caption="SDA hold time is disabled" value="0x0"/>
        <value name="75NS" caption="SDA hold time is 50-100 ns" value="0x1"/>
        <value name="450NS" caption="SDA hold time is 300-600 ns" value="0x2"/>
        <value name="600NS" caption="SDA hold time is 400-800 ns" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SPEED">
        <value name="SM_MODE" caption="Standard-mode (Sm) and Fast-mode (Fm)" value="0x0"/>
        <value name="FASTPLUS_MODE" caption="Fast-mode Plus (Fm+)" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__INACTOUT">
        <value name="DIS" caption="Disabled" value="0x0"/>
        <value name="55US" caption="5-6 SCL cycle time-out (50-60 us)" value="0x1"/>
        <value name="105US" caption="10-11 SCL cycle time-out (100-110 us)" value="0x2"/>
        <value name="205US" caption="20-21 SCL cycle time-out (200-210 us)" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__MODE">
        <value name="USART_EXT" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI Client mode" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI Host mode" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C Client mode" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C Host mode" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__SDAHOLD">
        <value name="DIS" caption="Disabled" value="0x0"/>
        <value name="75NS" caption="50-100 ns hold time" value="0x1"/>
        <value name="450NS" caption="300-600 ns hold time" value="0x2"/>
        <value name="600NS" caption="400-800 ns hold time" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__SPEED">
        <value name="SM_MODE" caption="Standard-mode (Sm) and Fast-mode (Fm)" value="0x0"/>
        <value name="FASTPLUS_MODE" caption="Fast-mode Plus (Fm+)" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__MODE">
        <value name="USART_EXT" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI Client mode" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI Host mode" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C Client mode" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C Host mode" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__DOPO">
        <value name="MUX0" caption="PAD[0]=DO, PAD[1]=SCK, PAD[2]=SS" value="0x0"/>
        <value name="MUX1" caption="PAD[2]=DO, PAD[3]=SCK, PAD[1]=SS" value="0x1"/>
        <value name="MUX2" caption="PAD[3]=DO, PAD[1]=SCK, PAD[2]=SS" value="0x2"/>
        <value name="MUX3" caption="PAD[0]=DO, PAD[3]=SCK, PAD[1]=SS" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__DIPO">
        <value name="MUX0" caption="SERCOM PAD[0] is used as data input" value="0x0"/>
        <value name="MUX1" caption="SERCOM PAD[1] is used as data input" value="0x1"/>
        <value name="MUX2" caption="SERCOM PAD[2] is used as data input" value="0x2"/>
        <value name="MUX3" caption="SERCOM PAD[3] is used as data input" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPI_CTRLA__FORM">
        <value name="SPI_FRAME" caption="SPI Frame" value="0x0"/>
        <value name="SPI_FRAME_WITH_ADDR" caption="SPI Frame with Address" value="0x2"/>
      </value-group>
