zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
      <value-group name="SERCOM_USART_CTRLB__ENC">
        <value name="IRDA" caption="Data is IrDA encoded" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__PMODE">
        <value name="EVEN" caption="Even parity" value="0x0"/>
        <value name="ODD" caption="Odd parity" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__LINCMD">
        <value name="NONE" caption="Normal USART transmission" value="0x0"/>
        <value name="SOFTWARE_CONTROL_TRANSMIT_CMD" caption="A break field is transmitted when DATA is written" value="0x1"/>
        <value name="AUTO_TRANSMIT_CMD" caption="The break, sync, and identifier fields are automatically transmitted when the DATA is written with the identifier" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__BRKLEN">
        <value name="13_BIT_TIME" caption="The break field transmission is 13 bit times" value="0x0"/>
        <value name="17_BIT_TIME" caption="The break field transmission is 17 bit times" value="0x1"/>
        <value name="21_BIT_TIME" caption="The break field transmission is 21 bit times" value="0x2"/>
        <value name="26_BIT_TIME" caption="The break field transmission is 26 bit times" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__HDRDLY">
        <value name="1_BIT_TIME" caption="Delay between break and sync transmission is one bit time. Delay between sync and ID transmission is one bit time." value="0x0"/>
        <value name="4_BIT_TIME" caption="Delay between break and sync transmission is four bit times. Delay between sync and ID transmission is four bit times." value="0x1"/>
        <value name="8_BIT_TIME" caption="Delay between break and sync transmission is eight bit times. Delay between sync and ID transmission is four bit times." value="0x2"/>
        <value name="14_BIT_TIME" caption="Delay between break and sync transmission is 14 bit times. Delay between sync and ID transmission is four bit times." value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_STATUS__BUSSTATE">
        <value name="UNKNOWN" caption="The bus state is unknown to the I2C host, which will wait for a stop condition to be detected or for the bus to be forced into the IDLE state by software" value="0x0"/>
        <value name="IDLE" caption="The bus state is waiting for a transaction to be initialized" value="0x1"/>
        <value name="OWNER" caption="The I2C host is the current owner of the bus" value="0x2"/>
        <value name="BUSY" caption="Some other I2C host owns the bus" value="0x3"/>
      </value-group>
    </module>
    <module name="SUPC" id="06257" name2="pwr_supc_340k_arm_v1" version="v1" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="VLM" caption="Voltage Level Monitor Interrupt Enable" mask="0x8"/>
          <bitfield name="VDDIO2OK" caption="VDDIO2OK Interrupt Enable" mask="0x10"/>
          <bitfield name="VDDIO2LPMPOR" caption="VDDIO2 Low-Power Mode POR Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="VLM" caption="Voltage Level Monitor Interrupt Enable" mask="0x8"/>
          <bitfield name="VDDIO2OK" caption="VDDIO2 OK Interrupt Enable" mask="0x10"/>
          <bitfield name="VDDIO2LPMPOR" caption="VDDIO2 Low Power Mode POR Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" caption="Interrupt Flag Status and Clear">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="VLM" caption="Voltage Level Monitor" mask="0x8"/>
          <bitfield name="VDDIO2OK" caption="VDDIO2 OK" mask="0x10"/>
          <bitfield name="VDDIO2LPMPOR" caption="VDDIO2 Low Power Mode POR" mask="0x20"/>
        </register>
        <register name="INTFLAGSET" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="Interrupt Flag Software Set">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="VLM" caption="Voltage Level Monitor" mask="0x8"/>
          <bitfield name="VDDIO2OK" caption="VDDIO2 OK" mask="0x10"/>
          <bitfield name="VDDIO2LPMPOR" caption="VDDIO2 Low Power Mode POR" mask="0x20"/>
        </register>
        <register name="STATUS" offset="0x14" rw="R" size="4" caption="Status">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="VLM" caption="Voltage Level Monitor" mask="0x8"/>
          <bitfield name="VDDIO2OK" caption="VDDIO2 OK" mask="0x10"/>
          <bitfield name="VDDIO2LPMPOR" caption="VDDIO2 Low Power Mode POR" mask="0x20"/>
        </register>
        <register name="BODVDD" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VDD Brown-Out Detector Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="STDBYCFG" caption="BOD Configuration in Standby Sleep Mode" mask="0x20" values="SUPC_BODVDD__STDBYCFG"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="BOD Configuration in Active Mode" mask="0x100" values="SUPC_BODVDD__ACTCFG"/>
          <bitfield name="SAMPFREQ" caption="Sampling Frequency" mask="0x1000" values="SUPC_BODVDD__SAMPFREQ"/>
          <bitfield name="LEVEL" caption="BOD Level" mask="0x30000" values="SUPC_BODVDD__LEVEL"/>
          <bitfield name="VLMLVL" caption="Voltage Level Monitor Level" mask="0x3000000" values="SUPC_BODVDD__VLMLVL"/>
          <bitfield name="VLMCFG" caption="Voltage Level Monitor Interrupt Configuration" mask="0xC000000" values="SUPC_BODVDD__VLMCFG"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80000000"/>
        </register>
        <register name="VREG" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Voltage Regulator Control">
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
        <register name="MVIO" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="MVIO Control">
          <bitfield name="MODE" caption="Operation Mode" mask="0x1" values="SUPC_MVIO__MODE"/>
          <bitfield name="VDDIO2CFG" caption="VDDIO2 Configuration" mask="0xC" values="SUPC_MVIO__VDDIO2CFG"/>
        </register>
        <register name="EVCTRL" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="MVIOEO" caption="MVIO Event Output Enable" mask="0x1"/>
          <bitfield name="VLMEO" caption="VLM Event Output Enable" mask="0x2"/>
        </register>
        <register name="WPCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Write Protection Control">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPLCK" caption="Write Protection Lock" mask="0x2"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00" values="SUPC_WPCTRL__WPKEY"/>
        </register>
      </register-group>
