zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
        <register name="STATUS" offset="0x30" rw="RW" access="RWSYNC" size="4" initval="0x00000001" caption="Status">
          <bitfield name="STOP" caption="Stop" mask="0x1"/>
          <bitfield name="IDX" caption="Ramp Index" mask="0x2"/>
          <bitfield name="UFS" caption="Non-recoverable Update Fault State" mask="0x4"/>
          <bitfield name="DFS" caption="Debug Fault State" mask="0x8"/>
          <bitfield name="PATTBUFV" caption="Pattern Generator Value Buffer Valid" mask="0x20"/>
          <bitfield name="PERBUFV" caption="Period Buffer Valid" mask="0x80"/>
          <bitfield name="FAULTAIN" caption="Recoverable Fault A Input" mask="0x100"/>
          <bitfield name="FAULTBIN" caption="Recoverable Fault B Input" mask="0x200"/>
          <bitfield name="FAULT0IN" caption="Non-Recoverable Fault 0 Input" mask="0x400"/>
          <bitfield name="FAULT1IN" caption="Non-Recoverable Fault 1 Input" mask="0x800"/>
          <bitfield name="FAULTA" caption="Recoverable Fault A State" mask="0x1000"/>
          <bitfield name="FAULTB" caption="Recoverable Fault B State" mask="0x2000"/>
          <bitfield name="FAULT0" caption="Non-recoverable Fault 0 State" mask="0x4000"/>
          <bitfield name="FAULT1" caption="Non-recoverable Fault 1 State" mask="0x8000"/>
          <bitfield name="CCBUFV0" caption="Compare/Capture Channel 0 Buffer Valid" mask="0x10000"/>
          <bitfield name="CCBUFV1" caption="Compare/Capture Channel 1 Buffer Valid" mask="0x20000"/>
          <bitfield name="CCBUFV2" caption="Compare/Capture Channel 2 Buffer Valid" mask="0x40000"/>
          <bitfield name="CCBUFV3" caption="Compare/Capture Channel 3 Buffer Valid" mask="0x80000"/>
          <bitfield name="CMP0" caption="Compare Channel 0 Value" mask="0x1000000"/>
          <bitfield name="CMP1" caption="Compare Channel 1 Value" mask="0x2000000"/>
          <bitfield name="CMP2" caption="Compare Channel 2 Value" mask="0x4000000"/>
          <bitfield name="CMP3" caption="Compare Channel 3 Value" mask="0x8000000"/>
        </register>
        <register name="COUNT" offset="0x34" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Counter">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
        </register>
        <register name="PATT" offset="0x38" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Pattern">
          <bitfield name="PGE0" caption="Pattern Generation Output 0 Enable" mask="0x1"/>
          <bitfield name="PGE1" caption="Pattern Generation Output 1 Enable" mask="0x2"/>
          <bitfield name="PGE2" caption="Pattern Generation Output 2 Enable" mask="0x4"/>
          <bitfield name="PGE3" caption="Pattern Generation Output 3 Enable" mask="0x8"/>
          <bitfield name="PGV0" caption="Pattern Generation Output 0 Value" mask="0x100"/>
          <bitfield name="PGV1" caption="Pattern Generation Output 1 Value" mask="0x200"/>
          <bitfield name="PGV2" caption="Pattern Generation Output 2 Value" mask="0x400"/>
          <bitfield name="PGV3" caption="Pattern Generation Output 3 Value" mask="0x800"/>
        </register>
        <register name="WAVE" offset="0x3C" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Waveform">
          <mode name="DEFAULT"/>
          <mode name="DUALCOMPARE" qualifier="TCC.WAVE.WAVEGEN" value="3"/>
          <mode name="DUALSLOPE" qualifier="TCC.WAVE.WAVEGEN" value="4 5 6 7"/>
          <mode name="SINGLESLOPE" qualifier="TCC.WAVE.WAVEGEN" value="0 1 2"/>
          <bitfield modes="DEFAULT" name="WAVEGEN" caption="Waveform Generation Operation" mask="0x7" values="TCC_WAVE__WAVEGEN"/>
          <bitfield modes="DEFAULT" name="RAMP" caption="Ramp Operation" mask="0x70" values="TCC_WAVE__RAMP"/>
          <bitfield modes="DEFAULT" name="CIPEREN" caption="Circular Period Enable" mask="0x80"/>
          <bitfield modes="DEFAULT" name="CICCEN0" caption="Circular Compare/Capture Channel 0 Enable" mask="0x100"/>
          <bitfield modes="DEFAULT" name="CICCEN1" caption="Circular Compare/Capture Channel 1 Enable" mask="0x200"/>
          <bitfield modes="DEFAULT" name="CICCEN2" caption="Circular Compare/Capture Channel 2 Enable" mask="0x400"/>
          <bitfield modes="DEFAULT" name="CICCEN3" caption="Circular Compare/Capture Channel 3 Enable" mask="0x800"/>
          <bitfield modes="DUALCOMPARE" name="POL0" caption="Channel 0 Polarity" mask="0x10000" values="TCC_WAVE_DUALCOMPARE__POLx"/>
          <bitfield modes="DUALSLOPE" name="POL0" caption="Channel 0 Polarity" mask="0x10000" values="TCC_WAVE_DUALSLOPE__POLx"/>
          <bitfield modes="SINGLESLOPE" name="POL0" caption="Channel 0 Polarity" mask="0x10000" values="TCC_WAVE_SINGLESLOPE__POLx"/>
          <bitfield modes="DUALCOMPARE" name="POL1" caption="Channel 1 Polarity" mask="0x20000" values="TCC_WAVE_DUALCOMPARE__POLx"/>
          <bitfield modes="DUALSLOPE" name="POL1" caption="Channel 1 Polarity" mask="0x20000" values="TCC_WAVE_DUALSLOPE__POLx"/>
          <bitfield modes="SINGLESLOPE" name="POL1" caption="Channel 1 Polarity" mask="0x20000" values="TCC_WAVE_SINGLESLOPE__POLx"/>
          <bitfield modes="DUALCOMPARE" name="POL2" caption="Channel 2 Polarity" mask="0x40000" values="TCC_WAVE_DUALCOMPARE__POLx"/>
          <bitfield modes="DUALSLOPE" name="POL2" caption="Channel 2 Polarity" mask="0x40000" values="TCC_WAVE_DUALSLOPE__POLx"/>
          <bitfield modes="SINGLESLOPE" name="POL2" caption="Channel 2 Polarity" mask="0x40000" values="TCC_WAVE_SINGLESLOPE__POLx"/>
          <bitfield modes="DUALCOMPARE" name="POL3" caption="Channel 3 Polarity" mask="0x80000" values="TCC_WAVE_DUALCOMPARE__POLx"/>
          <bitfield modes="DUALSLOPE" name="POL3" caption="Channel 3 Polarity" mask="0x80000" values="TCC_WAVE_DUALSLOPE__POLx"/>
          <bitfield modes="SINGLESLOPE" name="POL3" caption="Channel 3 Polarity" mask="0x80000" values="TCC_WAVE_SINGLESLOPE__POLx"/>
        </register>
        <register name="PER" offset="0x40" rw="RW" access="WSYNC" size="4" initval="0xFFFFFFFF" caption="Period">
          <bitfield name="PER" caption="Period Value" mask="0xFFFF"/>
        </register>
        <register name="CC" offset="0x44" rw="RW" access="WSYNC" size="4" count="4" initval="0x00000000" caption="Compare/Capture Channel #">
          <bitfield name="CC" caption="Compare/Capture Channel Value" mask="0xFFFF"/>
        </register>
        <register name="PATTBUF" offset="0x64" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="Pattern Buffer">
          <bitfield name="PGEB0" caption="Pattern Generation Output Enable Buffer 0" mask="0x1"/>
          <bitfield name="PGEB1" caption="Pattern Generation Output Enable Buffer 1" mask="0x2"/>
          <bitfield name="PGEB2" caption="Pattern Generation Output Enable Buffer 2" mask="0x4"/>
          <bitfield name="PGEB3" caption="Pattern Generation Output Enable Buffer 3" mask="0x8"/>
          <bitfield name="PGVB0" caption="Pattern Generation Output Value Buffer 0" mask="0x100"/>
          <bitfield name="PGVB1" caption="Pattern Generation Output Value Buffer 1" mask="0x200"/>
          <bitfield name="PGVB2" caption="Pattern Generation Output Value Buffer 2" mask="0x400"/>
          <bitfield name="PGVB3" caption="Pattern Generation Output Value Buffer 3" mask="0x800"/>
        </register>
        <register name="PERBUF" offset="0x6C" rw="RW" access="WSYNC" size="4" initval="0xFFFFFFFF" caption="Period Buffer">
          <bitfield name="PERBUF" caption="Period Buffer Value" mask="0xFFFF"/>
        </register>
        <register name="CCBUF" offset="0x70" rw="RW" access="WSYNC" size="4" count="4" initval="0x00000000" caption="Compare/Capture Channel # Buffer">
          <bitfield name="CCBUF" caption="Compare/Capture Channel Buffer Value" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="TCC_CTRLA__PRESCALER">
        <value name="DIV1" caption="Prescaler: GCLK_TCC" value="0x0"/>
        <value name="DIV2" caption="Prescaler: GCLK_TCC/2" value="0x1"/>
        <value name="DIV4" caption="Prescaler: GCLK_TCC/4" value="0x2"/>
        <value name="DIV8" caption="Prescaler: GCLK_TCC/8" value="0x3"/>
        <value name="DIV16" caption="Prescaler: GCLK_TCC/16" value="0x4"/>
        <value name="DIV64" caption="Prescaler: GCLK_TCC/64" value="0x5"/>
        <value name="DIV256" caption="Prescaler: GCLK_TCC/256" value="0x6"/>
        <value name="DIV1024" caption="Prescaler: GCLK_TCC/1024" value="0x7"/>
      </value-group>
      <value-group name="TCC_CTRLA__PRESCSYNC">
        <value name="GCLK" caption="Reload or reset Counter on the next GCLK" value="0x0"/>
        <value name="PRESC" caption="Reload or reset Counter on the next prescaler clock" value="0x1"/>
        <value name="RESYNC" caption="Reload or reset Counter on the next GCLK and reset prescaler counter" value="0x2"/>
      </value-group>
      <value-group name="TCC_CTRLBSET__IDXCMD">
        <value name="DISABLE" caption="Command disabled: IDX toggles between cycles A and B" value="0x0"/>
        <value name="SET" caption="Set IDX: Cycle B will be forced in the next cycle" value="0x1"/>
        <value name="CLEAR" caption="Clear IDX: Cycle A will be forced in next cycle" value="0x2"/>
        <value name="HOLD" caption="Hold IDX: The next cycle will be the same as the current cycle" value="0x3"/>
      </value-group>
