zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/atdf/PIC32CM6408PL10048.atdf
      <value-group name="TCC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RETRIGGER" caption="Force start, restart or retrigger" value="0x1"/>
        <value name="STOP" caption="Force stop" value="0x2"/>
        <value name="UPDATE" caption="Force update of double buffered registers" value="0x3"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="0x4"/>
        <value name="DMAOS" caption="One-shot DMA trigger" value="0x5"/>
      </value-group>
      <value-group name="TCC_FCTRLA__SRC">
        <value name="DISABLE" caption="Fault input disabled" value="0x0"/>
        <value name="ENABLE" caption="MCEn (n = 0,1) event input" value="0x1"/>
        <value name="INVERT" caption="Inverted MCEn (n = 0,1) event input" value="0x2"/>
        <value name="ALTFAULT" caption="Alternate fault (A or B) state at the end of the previous period." value="0x3"/>
      </value-group>
      <value-group name="TCC_FCTRLA__BLANK">
        <value name="START" caption="Blanking is applied from the start of the ramp period" value="0x0"/>
        <value name="RISE" caption="Blanking is applied from the rising edge of the waveform output" value="0x1"/>
        <value name="FALL" caption="Blanking is applied from the falling edge of the waveform output" value="0x2"/>
        <value name="BOTH" caption="Blanking is applied from each toggle of the waveform output" value="0x3"/>
      </value-group>
      <value-group name="TCC_FCTRLA__HALT">
        <value name="DISABLE" caption="Halt action disabled" value="0x0"/>
        <value name="HW" caption="Hardware halt action" value="0x1"/>
        <value name="SW" caption="Software halt action" value="0x2"/>
        <value name="NR" caption="Non-recoverable fault" value="0x3"/>
      </value-group>
      <value-group name="TCC_FCTRLA__CHSEL">
        <value name="CC0" caption="The captured value stored in CC0" value="0x0"/>
        <value name="CC1" caption="The captured value stored in CC1" value="0x1"/>
        <value name="CC2" caption="The captured value stored in CC2" value="0x2"/>
        <value name="CC3" caption="The captured value stored in CC3" value="0x3"/>
      </value-group>
      <value-group name="TCC_FCTRLA__CAPTURE">
        <value name="DISABLE" caption="Capture on valid recoverable Fault is disabled" value="0x0"/>
        <value name="CAPT" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0]The INTFLAG.FAULTn flag is set on each new captured value." value="0x1"/>
        <value name="CAPTMIN" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0] if the COUNT value is lower than the last stored capture value (CC).The INTFLAG.FAULTn flag is set on each local minimum detection." value="0x2"/>
        <value name="CAPTMAX" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0] if the COUNT value is higher than the last stored capture value (CC).The INTFLAG.FAULTn flag is set on each local maximun detection." value="0x3"/>
        <value name="LOCMIN" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local minimum value detection." value="0x4"/>
        <value name="LOCMAX" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local maximun detection." value="0x5"/>
        <value name="DERIV0" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local maximun or minimum detection." value="0x6"/>
        <value name="CAPTMARK" caption="Capture with the ramp index as the MSB value" value="0x7"/>
      </value-group>
      <value-group name="TCC_FCTRLB__SRC">
        <value name="DISABLE" caption="Fault input disabled" value="0x0"/>
        <value name="ENABLE" caption="MCEn (n = 0,1) event input" value="0x1"/>
        <value name="INVERT" caption="Inverted MCEn (n = 0,1) event input" value="0x2"/>
        <value name="ALTFAULT" caption="Alternate fault (A or B) state at the end of the previous period." value="0x3"/>
      </value-group>
      <value-group name="TCC_FCTRLB__BLANK">
        <value name="START" caption="Blanking is applied from the start of the ramp period" value="0x0"/>
        <value name="RISE" caption="Blanking is applied from the rising edge of the waveform output" value="0x1"/>
        <value name="FALL" caption="Blanking is applied from the falling edge of the waveform output" value="0x2"/>
        <value name="BOTH" caption="Blanking is applied from each toggle of the waveform output" value="0x3"/>
      </value-group>
      <value-group name="TCC_FCTRLB__HALT">
        <value name="DISABLE" caption="Halt action disabled" value="0x0"/>
        <value name="HW" caption="Hardware halt action" value="0x1"/>
        <value name="SW" caption="Software halt action" value="0x2"/>
        <value name="NR" caption="Non-recoverable fault" value="0x3"/>
      </value-group>
      <value-group name="TCC_FCTRLB__CHSEL">
        <value name="CC0" caption="The captured value stored in CC0" value="0x0"/>
        <value name="CC1" caption="The captured value stored in CC1" value="0x1"/>
        <value name="CC2" caption="The captured value stored in CC2" value="0x2"/>
        <value name="CC3" caption="The captured value stored in CC3" value="0x3"/>
      </value-group>
      <value-group name="TCC_FCTRLB__CAPTURE">
        <value name="DISABLE" caption="Capture on valid recoverable Fault is disabled" value="0x0"/>
        <value name="CAPT" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0]The INTFLAG.FAULTn flag is set on each new captured value." value="0x1"/>
        <value name="CAPTMIN" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0] if the COUNT value is lower than the last stored capture value (CC).The INTFLAG.FAULTn flag is set on each local minimum detection." value="0x2"/>
        <value name="CAPTMAX" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0] if the COUNT value is higher than the last stored capture value (CC).The INTFLAG.FAULTn flag is set on each local maximun detection." value="0x3"/>
        <value name="LOCMIN" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local minimum value detection." value="0x4"/>
        <value name="LOCMAX" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local maximun detection." value="0x5"/>
        <value name="DERIV0" caption="On the rising edge of a valid recoverable fault, the counter value is captured on the channel selected by CHSEL[1:0].The INTFLAG.FAULTn flag is set on each local maximun or minimum detection." value="0x6"/>
        <value name="CAPTMARK" caption="Capture with the ramp index as the MSB value" value="0x7"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT0">
        <value name="OFF" caption="Event action disabled" value="0x0"/>
        <value name="RETRIGGER" caption="Restart or retrigger TCC on event" value="0x1"/>
        <value name="COUNTEV" caption="Count on event" value="0x2"/>
        <value name="START" caption="Start TCC on event" value="0x3"/>
        <value name="INC" caption="Increment TCC on event" value="0x4"/>
        <value name="COUNT" caption="Count on the active state of an asynchronous event" value="0x5"/>
        <value name="STAMP" caption="Capture Time-stamp (overflow)" value="0x6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="0x7"/>
      </value-group>
      <value-group name="TCC_EVCTRL__EVACT1">
        <value name="OFF" caption="Event action disabled" value="0x0"/>
        <value name="RETRIGGER" caption="Restart or retrigger TCC on event" value="0x1"/>
        <value name="DIR" caption="Direction control" value="0x2"/>
        <value name="STOP" caption="Stop TCC on event" value="0x3"/>
        <value name="DEC" caption="Decrement TCC on event" value="0x4"/>
        <value name="PWP" caption="Period captured into CC1 Pulse Width on CC0" value="0x6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="0x7"/>
      </value-group>
